/*Задача 13. Дано масив розмірності N. Назвемо серією групу однакових елементів що йдуть поспіль, а довжиною 
серії - кількість цих елементів. Додати після кожної серії елемент з текстом «серія k», де k – порядковой номер серії*/

// Спосіб вирішення з утворенням нового масиву

const array = [2, 2, 9, 105, 1, 1, 1, 2, 3, 3, 4, 4, 17, 98, 98, 99, 105, 105];
const finalArray = [];
let seriaNum = 0;

for (let i = 0, j = 0; i < array.length; i++, j++) { // вводимо індекс "j" для того, щоб індекси нового масиву відрізнялися від індексу і старого масиву

    finalArray[j] = array[i]; // в новий масив в будь-якому разі пишуться усі елементи старого масиву

    if (array[i] === array[i - 1] && array[i] !== array[i + 1]) {
        seriaNum++; // позначаємо порядковий номер серії    
        j++;        // збільшуємо лічильник j щоб "серія №" не перезаписувала елементи
        finalArray[j] = `seria ${seriaNum}`;
    }
}
console.log(finalArray);


// Спосіб вирішення з перетворенням вхідного масиву шляхом зміщення елементів вправо

/*const array = [2, 2, 9, 105, 1, 1, 1, 2, 3, 3, 4, 4, 17, 98, 98, 99, 105, 105];
let seriaNum = 0;


for (let i = 0; i < array.length; i++) {
    //console.log(`iter ${i} - ${array[i - 1]}---${array[i + 1]}`)
    if (array[i] === array[i - 1] && array[i] !== array[i + 1]) {
        seriaNum++;


        for (let j = array.length; j > i + 1; j--) {
            array[j] = array[j - 1];
        }
        array[i + 1] = `seria ${seriaNum}`;
    }
}
console.log(array);*/