/* Дано три дійсні змінні a, b і c. 
 Скласти  алгоритм, який міняє місцями значення цих змінних наступним чином: 
 змінна a набуває значення змінної b, змінна b набуває значення змінної c, а змінна  c – попереднє значення змінної a */

 let salary = prompt('Вводимо значення змінної "а"');

 let taxes = prompt('Вводимо значення змінної "b"');

 let income = prompt('Вводимо значення змінної "c"');

 let deposit = salary;

 salary = taxes;

 taxes = income;

 income = deposit;

 alert(`Змінна "a" тепер = ${salary}`);

 alert(`Змінна "b" тепер = ${taxes}`);

 alert(`Змінна "c" тепер = ${income}`);